    //请求头Pequestrian Headers
    /*http请求中的常用头（请求头）的含义：
    Accept：            告诉服务器，客户端支持的数据类型。
    Accept-Charset：    告诉服务器，客户端采用的编码。
    Accept-Encoding：   告诉服务器，客户机支持的数据压缩格式。
    Accept-Language：   告诉服务器，客户机的语言环境。
    Host：              客户机通过这个头告诉服务器，想访问的主机名
    If-Modified-Since:  客户机通过这个头告诉服务器，资源的缓存时间。
    Referer:            客户机通过这个头告诉服务器，它是从哪个资源来访问服务器的。（一般用于防盗链）
    User-Agent:         客户机通过这个头告诉服务器，客户机的软件环境。
    Cookie：            客户机通过这个头告诉服务器，可以向服务器带数据。

    cookie是临时文件的意思，保存你浏览网页的痕迹，使得再次上同一页面的时候提高网速，判断你是否登录过这个网站，有些可以帮你自动登录的。

    Cookie就是服务器暂存放在你的电脑里的资料（.txt格式的文本文件），通过在HTTP传输中的状态好让服务器用来辨认你的计算机。当你在浏览网站的时候，Web服务器会先送一小小资料放在你的计算机上，Cookie 会帮你在网站上所打的文字或是一些选择都记录下来。当下次你再访问同一个网站，Web服务器会先看看有没有它上次留下的Cookie资料，有的话，就会依据Cookie里的内容来判断使用者，送出特定的网页内容给你。
    */